"1. Proven Korean Cosmetics  \n\nDimodo has been supplying more than 300 cosmetics since its service in early 2020. We only bring trustable reviews from Korean to help our users find the best cosmetics that suit our customers best. There are no identical consumers in the beauty market. Individual age, skin type, taste, and value. We aim to build a place that shows your true ideas and feelings.\n",

"2. Get the cheapest Price \n\nDimodo's founder is Korean who lives in Danang and believes Vietnamese deserve a better price to buy Korean cosmetics by providing Real-Time Korean prices to users. Upcoming days we will offer the users a price match. \n",

"3. Money Back Guarantee Policy? \n\nWe do have a 7 day money back guarantee for all of purchased cosmetics and clothes in our App. Our money back guarantee gives you peace of mind that our services will meet the expectations set out in the Terms of Service. To the maximum extent applicable under national law and without affecting your rights as a consumer, the money back guarantee is your sole and exclusive remedy should our services fail to meet the expectations set out in this Terms of Service. The following conditions apply to our money back guarantee: \n\n- Purchased items guaranteed for 7 days from the date of original purchase are in the warranty period. \n\n- The user provides corresponding certification materials sufficient to prove that the goods are fake, such as brand certification, third-party quality inspection certification, etc. \n\n- Defined as damaged or defective items are covered. \n\n- Unpacked or used products are not covered. \n\n- Man-made damaged, washed, or the signs disassembled products are not covered\n",

"1. Why Dimodo price is lower than the market price?  \n\nDimodo's founder is Korean who believe Vietnamese deserve a better price to buy Korean cosmetics by providing Real-Time Korean price to Vietnamese.\n",
"2. Where do those reviews come from?  \n\nTo choose more suitable Korean cosmetics, Dimodo provides all reviews from Glowpick, the most famous popular Korean beauty ranking service in Korea.\n",
"3. Are the quality of the goods in the direct stores the same? \n\nThe products in Dimodo are strictly controlled by our Korean founder. From the selection of the goods to the after-sales service, Dimodo cosmetics purchase from Korean official channels and ship to your home. Make sure you buy it with ease, use it with peace of mind, you can buy it with confidence, the quality of the same product is completely consistent.\n",